Test/Jerome_Test/ManageResourceInventory/IIS/xml/5-1_srr_getManagedElementRequest.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:mer="http://www.tmforum.org/mtop/mri/xsd/mer/v1" xmlns:nam="http://www.tmforum.org/mtop/fmw/xsd/nam/v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.tmforum.org/mtop/mri/xsd/mer/v1 ../xsd/ManagedElementRetrievalMessagesV1-0.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <wsa:To>http://host:port/ServiceProvider</wsa:To>
    <wsa:Action>http://www.tmforum.org/mtop/mri/wsdl/mer/v1-0/getManagedElementRequest</wsa:Action>
  </soap:Header>
  <soap:Body>
    <mer:getManagedElementRequest>
      <mer:meName>
        <nam:object>
          <nam:type>mdNm</nam:type>
          <nam:name>string</nam:name>
        </nam:object>
        <nam:object>
          <nam:type>meNm</nam:type>
          <nam:name>string</nam:name>
        </nam:object>
      </mer:meName>
    </mer:getManagedElementRequest>
  </soap:Body>
</soap:Envelope>
