Product/trunk/DDPs/ManageResourceInventory/IIS/xml/6-3_sit_getManagedElementsIteratorRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:hdr="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1" xmlns:mer="http://www.tmforum.org/mtop/mri/xsd/mer/v1" xmlns:nam="http://www.tmforum.org/mtop/fmw/xsd/nam/v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.tmforum.org/mtop/mri/xsd/mer/v1 ../xsd/ManagedElementRetrievalMessages.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <hdr:header>
      <hdr:activityName>getManagedElementsIterator</hdr:activityName>
      <hdr:msgName>getManagedElementsIteratorRequest</hdr:msgName>
      <hdr:msgType>REQUEST</hdr:msgType>
      <hdr:senderURI>/MTOSI/InventoryOS</hdr:senderURI>
      <hdr:destinationURI>/MTOSI/EmsOS</hdr:destinationURI>
      <hdr:communicationPattern>MultipleBatchResponse</hdr:communicationPattern>
      <hdr:communicationStyle>RPC</hdr:communicationStyle>
      <hdr:iteratorReferenceURI>http://host:port/ManagedElementRetrievalV1/iterator123</hdr:iteratorReferenceURI>
      <hdr:timestamp>2007-07-30T09:26:00</hdr:timestamp>
    </hdr:header>
  </soap:Header>
  <soap:Body>
    <mer:getManagedElementsIteratorRequest/>
  </soap:Body>
</soap:Envelope>
