mtosi_2.0/2.0FullME/DDPs/ManageResourceInventory/IIS/xml/5-1_srr_getManagedElementRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:hdr="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1" xmlns:mer="http://www.tmforum.org/mtop/mri/xsd/mer/v1" xmlns:nam="http://www.tmforum.org/mtop/fmw/xsd/nam/v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.tmforum.org/mtop/mri/xsd/mer/v1 ../xsd/ManagedElementRetrievalMessages.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <hdr:header>
      <hdr:activityName>getManagedElement</hdr:activityName>
      <hdr:msgName>getManagedElementRequest</hdr:msgName>
      <hdr:msgType>REQUEST</hdr:msgType>
      <hdr:senderURI>/MTOSI/InventoryOS</hdr:senderURI>
      <hdr:destinationURI>/MTOSI/EmsOS</hdr:destinationURI>
      <hdr:communicationPattern>SimpleResponse</hdr:communicationPattern>
      <hdr:communicationStyle>RPC</hdr:communicationStyle>
      <hdr:timestamp>2007-07-30T09:26:00</hdr:timestamp>
    </hdr:header>
  </soap:Header>
  <soap:Body>
    <mer:getManagedElementRequest>
      <mer:meName>
        <nam:rdn>
          <nam:type>MD</nam:type>
          <nam:value>string</nam:value>
        </nam:rdn>
        <nam:rdn>
          <nam:type>ME</nam:type>
          <nam:value>string</nam:value>
        </nam:rdn>
      </mer:meName>
    </mer:getManagedElementRequest>
  </soap:Body>
</soap:Envelope>
