xml/hostByIdEnvelope.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1" xmlns:v11="http://www.tmforum.org/mtop/mri/xsd/mer/v1" xmlns:v12="http://www.tmforum.org/mtop/fmw/xsd/nam/v1">
   <soapenv:Header>
      <v1:header>
         <v1:security>?u2000user?:?u2000password?</v1:security>
         <v1:communicationPattern>SimpleResponse</v1:communicationPattern>
         <v1:communicationStyle>RPC</v1:communicationStyle>
      </v1:header>
   </soapenv:Header>
   <soapenv:Body>
      <v11:getManagedElementRequest>
         <!--Optional:-->
         <v11:meRef>
            <!--1 or more repetitions:-->
            <v12:rdn>
               <v12:type>MD</v12:type>
               <v12:value>Huawei/U2000</v12:value>
            </v12:rdn>
            <v12:rdn>
               <v12:type>ME</v12:type>
               <v12:value>?</v12:value>
            </v12:rdn>
         </v11:meRef>
      </v11:getManagedElementRequest>
   </soapenv:Body>
</soapenv:Envelope>